Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: If you wish to learn more about Quarkus-specific features and limitations there is a Quarkus xref:cdi-reference.adoc[CDI Reference Guide]. We also recommend you to read the https://jakarta.ee/specifications/cdi/4.0/jakarta-cdi-spec-4.0.html[CDI specification] and the https://docs.jboss.org/weld/reference/latest/en-US/html/[Weld documentation] (Weld is a CDI Reference Implementation) to get acquainted with more complex topics.
ja_jp: Quarkus固有の機能や制限について詳しく知りたい場合は、Quarkus xref:cdi-reference.adoc[CDIリファレンスガイド] があります。また、より複雑なトピックに精通するために、 link:https://jakarta.ee/specifications/cdi/4.0/jakarta-cdi-spec-4.0.html[CDI仕様書] や link:https://docs.jboss.org/weld/reference/latest/en-US/html/[Weldドキュメント] （WeldはCDIリファレンス実装です）を読むことをお勧めします。

source: If you wish to learn more about Quarkus-specific features and limitations there is a Quarkus xref:cdi-reference.adoc[CDI Reference Guide]. We also recommend you to read the https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html[CDI specification] and the https://docs.jboss.org/weld/reference/latest/en-US/html/[Weld documentation] (Weld is a CDI Reference Implementation) to get acquainted with more complex topics.
ja_jp: Quarkus 固有の機能と制限に関する詳細は、Quarkus xref:cdi-reference.adoc[CDI リファレンスガイド] を参照してください。 より複雑なトピックを理解するために、 https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html[CDI 仕様] と https://docs.jboss.org/weld/reference/latest/en-US/html/[Weld ドキュメント] (Weld は CDI リファレンス実装です) を参照することを推奨します。

source: If you wish to make sure your exception mapper is called for your exception type even when it is wrapped by one of those wrapper exceptions, you can use `@UnwrapException` on the exception wrapper type:
ja_jp: 例外マッパーがラッパー例外のいずれかによってラップされている場合でも、例外タイプに対して例外マッパーが呼び出されるようにする場合は、例外ラッパータイプで `@UnwrapException` を使用できます。

source: If you wish to scale your server, you can set the number of server instances by setting `quarkus.grpc.server.instances`.
ja_jp: サーバーをスケールさせたい場合は、 `quarkus.grpc.server.instances` を設定することで、サーバーのインスタンス数をセットできます。

source: If you wish, you may compare your result against the complete worked example:
ja_jp: 必要に応じて、完全な作業例と結果を比較することもできます。

source: If you work only with JWT tokens and expect a matching `JsonWebKey` to always be available, for example, after refreshing a key set, you must disable token introspection, as shown in the following example:
ja_jp: JWT トークンのみを使用しており、一致する `JsonWebKey` が常に使用可能であることが予想される場合 (たとえば、キーセットを更新した後)、次の例に示すように、トークンイントロスペクションを無効にする必要があります。

source: If you work with JWT tokens only and expect that a matching `JsonWebKey` will always be available (possibly after a key set refresh) then you should disable the token introspection:
ja_jp: JWT トークンのみを使用していて、一致する `JsonWebKey` が常に使用可能になると予想される場合 (おそらくキーセットの更新後)、トークンのイントロスペクションを無効にする必要があります。

source: If you work with Keycloak and configure `mp.jwt.verify.publickey.location` to point to HTTPS or HTTP based JsonWebKey (JWK) set then you can use the same approach as described in the xref:security-oidc-bearer-token-authentication.adoc#integration-testing[OpenID Connect Bearer Token Integration testing] Keycloak section but only change the `application.properties` to use MP JWT configuration properties instead:
ja_jp: Keycloakと連携し、 `mp.jwt.verify.publickey.location` 、HTTPSまたはHTTPベースのJsonWebKey (JWK)セットを指すように設定している場合は、 xref:security-oidc-bearer-token-authentication.adoc#integration-testing[OpenID Connect Bearer Token結合テスト] Keycloakセクションで説明したのと同じアプローチを使用できますが、代わりにMP JWT設定プロパティを使用するように `application.properties` を変更するだけです：

source: If you work with Keycloak and configure `mp.jwt.verify.publickey.location` to point to HTTPS or HTTP based JsonWebKey (JWK) set then you can use the same approach as described in the xref:security-openid-connect.adoc#integration-testing-keycloak[OpenID Connect Bearer Token Integration testing] Keycloak section but only change the `application.properties` to use MP JWT configuration properties instead:
ja_jp: Keycloak を使用しており、さらに HTTPS または HTTP ベースの JsonWebKey (JWK) セットを指すように `mp.jwt.verify.publickey.location` を設定する場合は、xref:security-openid-connect.adoc#integration-testing-keycloak[OpenID Connect Bearer トークン統合テスト] の Keycloak セクションで説明したのと同じアプローチを使用できますが、その場合は代わりに MPJWT 設定プロパティーを使用するように `application.properties` を変更します。

source: If you work with Keycloak and configure `mp.jwt.verify.publickey.location` to point to HTTPS or HTTP based JsonWebKey (JWK) set then you can use the same approach as described in the xref:security-openid-connect.adoc#integration-testing-keycloak[OpenID Connect Bearer Token Integration testing] `Keycloak` section but only change the `application.properties` to use MP JWT configuration properties instead:
ja_jp: Keycloakを使用し、 `mp.jwt.verify.publickey.location` 、 httpsまたはHTTPベースのJsonWebKey（JWK）セットを指すように設定する場合、 xref:security-openid-connect.adoc#integration-testing-keycloak[OpenID Connect Bearer Token Integration testing] `Keycloak` のセクションで説明したのと同じ方法を使用でき、代わりにMP JWT設定プロパティを使用するように `application.properties` を変更するだけです:

source: If you work with Keycloak and configure `mp.jwt.verify.publickey.location` to point to HTTPS or HTTP-based JsonWebKey (JWK) set, you can use the same approach as described in the xref:security-oidc-bearer-token-authentication.adoc#bearer-token-integration-testing[OpenID Connect Bearer Token Integration testing] Keycloak section but only change the `application.properties` to use MP JWT configuration properties instead:
ja_jp: Keycloak を使用していて、 `mp.jwt.verify.publickey.location` を HTTPS または HTTP ベースの JsonWebKey (JWK) セットを指すように設定する場合は、xref:security-oidc-bearer-token-authentication.adoc#bearer-token-integration-testing[OpenID Connect Bearer Token Integration testing] Keycloak セクションで説明されているのと同じアプローチを使用できますが、代わりに MP JWT 設定プロパティーを使用するように `application.properties` のみを変更します。

source: If you work with Keycloak and observe the issuer verification errors due to the different host addresses then configure Keycloak with a `KEYCLOAK_FRONTEND_URL` property to ensure the same host address is used.
ja_jp: Keycloakを使用していて、ホストアドレスが異なるために発行者検証エラーが発生する場合は、Keycloakに `KEYCLOAK_FRONTEND_URL` プロパティを設定して、同じホストアドレスが使用されるようにしてください。

source: If you work with Keycloak then you can use the same approach as described in the xref:security-openid-connect#integration-testing-keycloak.adoc[OpenID Connect Bearer Token Integration testing] `Keycloak` section.
ja_jp: Keycloakを使用している場合は、 xref:security-openid-connect.adoc#integration-testing-keycloak.adoc[OpenID Connect Bearer Token Integration testing] `Keycloak` のセクションで説明したのと同じ方法を使用することができます。

source: If you work with Keycloak then you can use the same approach as described in the xref:security-openid-connect.adoc#integration-testing-keycloak[OpenID Connect Bearer Token Integration testing] Keycloak section.
ja_jp: Keycloak を使用する場合は、xref:security-openid-connect.adoc#integration-testing-keycloak[OpenID Connect Bearer Token 結合テスト] Keycloak セクションで説明したのと同じ方法を使用することができます。

source: If you work with Keycloak, start it with the `KEYCLOAK_FRONTEND_URL` system property set to the externally accessible base URL. If you work with other OIDC providers, check the documentation of your provider.
ja_jp: Keycloak を使用する場合は、 `KEYCLOAK_FRONTEND_URL` システムプロパティーを外部からアクセス可能なベース URL に設定して起動します。 他の OIDC プロバイダーと連携する場合は、プロバイダーのドキュメントを確認してください。

source: If you work with Keycloak, then start it with a `KEYCLOAK_FRONTEND_URL` system property set to the externally-accessible base URL. If you work with other OIDC providers, check the documentation of your provider.
ja_jp: Keycloak を使用する場合は、 `KEYCLOAK_FRONTEND_URL` システムプロパティーを外部からアクセス可能なベース URL に設定して起動します。 他の OIDC プロバイダーと連携する場合は、プロバイダーのドキュメントを確認してください。

source: If you work with Keycloak, you can use the same approach described in the xref:security-oidc-bearer-token-authentication.adoc#bearer-token-integration-testing-keycloak[OpenID Connect Bearer Token Integration testing] Keycloak section.
ja_jp: Keycloak を使用する場合は、xref:security-oidc-bearer-token-authentication.adoc#bearer-token-integration-testing-keycloak[OpenID Connect ベアラートークンインテグレーションのテスト] の Keycloak セクションで説明されているのと同じアプローチを使用できます。

source: If you work with Quarkus extensions which do not support `HTTP` (for example, `Quarkus GRPC`) or provide their own extension specific `HTTP` support conflicting with the one offered by `quarkus-smallrye-jwt` and `Vert.x HTTP` (example, `Quarkus Amazon Lambda`) and you would like to <<jwt-parser, Parse and Verify JsonWebToken with JWTParser>> then please use `smallrye-jwt` directly instead of `quarkus-smallrye-jwt`.
ja_jp: `HTTP` をサポートしない Quarkus エクステンション (たとえば `Quarkus GRPC`) を使用する、または `quarkus-smallrye-jwt` や `Vert.x HTTP` によって提供されるものと競合する独自のエクステンション固有の `HTTP` サポート (たとえば `Quarkus Amazon Lambda`) を提供する場合で、<<jwt-parser, JWTParser を使用した JsonWebToken の解析と検証>> を行う場合、 `quarkus-smallrye-jwt` の代わりに `smallrye-jwt` を直接使用してください。

source: If you work with a Quarkus OIDC `web-app` application then it is Quarkus OIDC Code Authentication mechanism which is managing the user session lifespan.
ja_jp: Quarkus OIDC `web-app` アプリケーションで作業している場合、ユーザーセッションの寿命を管理しているのはQuarkus OIDCコード認証メカニズムです。

source: If you work with a Quarkus OIDC `web-app` application, then the Quarkus OIDC code authentication mechanism manages the user session lifespan.
ja_jp: Quarkus OIDC `web-app` アプリケーションを使用する場合、Quarkus OIDC コード認証メカニズムがユーザーセッションの有効期間を管理します。

source: If you work with a social provider such as Google and are concerned that the users can be logged out from all their Google applications with the <<user-initiated-logout,User-Initiated Logout>> which redirects the users to the provider's logout endpoint then you can support a local logout with the help of the <<oidc-session,OidcSession>> which only clears the local session cookie, for example:
ja_jp: Google などのソーシャル・プロバイダーと連携しており、プロバイダーのログアウトエンドポイントにリダイレクトされる <<user-initiated-logout,ユーザー主導型ログアウト>> で、ユーザーがすべての Google アプリケーションからログアウトされることを懸念している場合は、ローカルセッションのクッキーのみをクリアする、 <<oidc-session,OidcSession>> でローカルログアウトをサポートすることができます。以下に例を示します。

source: If you work with link:https://www.keycloak.org/docs/latest/securing_apps/#_token-exchange[Keycloak] or another OIDC provider that supports a link:https://tools.ietf.org/html/rfc8693[Token Exchange] token grant, then you can configure `AccessTokenRequestReactiveFilter` to exchange the token like this:
ja_jp: link:https://www.keycloak.org/docs/latest/securing_apps/#_token-exchange[Keycloak] または link:https://tools.ietf.org/html/rfc8693[Token Exchange] トークングラントをサポートする別の OIDC プロバイダーを使用する場合は、次のように `AccessTokenRequestReactiveFilter` を設定してトークンを交換できます。

source: If you work with link:https://www.keycloak.org/docs/latest/securing_apps/#_token-exchange[Keycloak] or other OpenID Connect Providers which support a link:https://tools.ietf.org/html/rfc8693[Token Exchange] token grant then you can configure `AccessTokenRequestReactiveFilter` to exchange the token like this:
ja_jp: もし、現在のアクセストークンを伝播する前に交換する必要があり、かつ link:https://www.keycloak.org/docs/latest/securing_apps/#_token-exchange[Keycloak] やその他の link:https://tools.ietf.org/html/rfc8693[Token Exchange] トークングラントをサポートする OpenID Connect Provider で作業する場合は、 `AccessTokenRequestFilter` をこのように設定することが可能です。

source: If you work with link:https://www.keycloak.org/securing-apps/token-exchange[Keycloak] or another OIDC provider that supports a link:https://tools.ietf.org/html/rfc8693[Token Exchange] token grant, then you can configure `AccessTokenRequestReactiveFilter` to exchange the token like this:
ja_jp: link:https://www.keycloak.org/securing-apps/token-exchange[Keycloak] または another OIDC provider that supports a link:https://tools.ietf.org/html/rfc8693[Token Exchange] トークングラントをサポートする別の OIDC プロバイダーを使用する場合は、次のように `AccessTokenRequestReactiveFilter` を設定してトークンを交換できます。

source: If you work with opaque tokens, you can test them as shown in the following code example:
ja_jp: 不透明トークンを使用する場合は、次のコード例に示す方法でトークンをテストできます。

source: If you work with other providers then a Dev UI experience described in the <<keycloak-authorization-code-grant,Authorization Code Grant for Keycloak>> section might differ slightly. For example, an access token may not be in a JWT format so it won't be possible to show its internal content, though all providers should return an ID Token as JWT.
ja_jp: 他のプロバイダーと連携している場合、<<keycloak-authorization-code-grant,Authorization Code Grant for Keycloak>> セクションで説明した Dev UI とは若干異なる場合があります。たとえば、アクセストークンは JWT 形式ではない可能性があるため、内部コンテンツは表示できませんが、すべてのプロバイダーは ID トークンを JWT として返す必要があります。

source: If you work with other providers then a Dev UI experience described in the <<keycloak-authorization-code-grant,Authorization Code Grant for Keycloak>> section might differ slightly. For example, an access token may not be in a JWT format, so it won't be possible to show its internal content, though all providers should return an ID Token as JWT.
ja_jp: 他のプロバイダーと連携している場合、 <<keycloak-authorization-code-grant,Keycloakに対する認可コードグラント>> セクションで説明した Dev UI とは若干異なる場合があります。たとえば、アクセストークンは JWT 形式ではない可能性があるため、内部コンテンツは表示できませんが、すべてのプロバイダーは ID トークンを JWT として返す必要があります。

source: If you work with other providers then a Dev UI experience described in the xref:keycloak-authorization-code-grant[Authorization Code Grant for Keycloak] section might differ slightly. For example, an access token may not be in a JWT format, so it won't be possible to show its internal content, though all providers should return an ID Token as JWT.
ja_jp: 他のプロバイダーと連携している場合、 xref:keycloak-authorization-code-grant[Keycloakの認可コードグラント] のセクションで説明したDev UI体験は若干異なるかもしれません。例えば、アクセストークンはJWT形式ではないため、その内部コンテンツを表示することはできませんが、すべてのプロバイダーはIDトークンをJWTとして返すはずです。

source: If you work with providers such as `Azure` that link:https://learn.microsoft.com/en-us/azure/active-directory/develop/v2-oauth2-on-behalf-of-flow#example[require using] link:https://www.rfc-editor.org/rfc/rfc7523#section-2.1[JWT bearer token grant] to exchange the current token, then you can configure `AccessTokenRequestFilter` to exchange the token like this:
ja_jp: `Azure` のように、 link:https://www.rfc-editor.org/rfc/rfc7523#section-2.1[JWTベアラートークングラント] を使用して現在のトークンを交換する link:https://learn.microsoft.com/en-us/azure/active-directory/develop/v2-oauth2-on-behalf-of-flow#example[必要がある] プロバイダーを使用する場合、 `AccessTokenRequestFilter` のようにトークンを交換するように設定することができます。

source: If you work with providers such as `Azure` that link:https://learn.microsoft.com/en-us/azure/active-directory/develop/v2-oauth2-on-behalf-of-flow#example[require using] link:https://www.rfc-editor.org/rfc/rfc7523#section-2.1[JWT bearer token grant] to exchange the current token, then you can configure `AccessTokenRequestReactiveFilter` to exchange the token like this:
ja_jp: `Azure` のように、link:https://www.rfc-editor.org/rfc/rfc7523#section-2.1[JWTベアラートークングラント] を使用して現在のトークンを交換する link:https://learn.microsoft.com/en-us/azure/active-directory/develop/v2-oauth2-on-behalf-of-flow#example[必要がある] プロバイダーを使用する場合、 `AccessTokenRequestReactiveFilter` をトークンを交換するように設定できます。

source: If you work with providers such as `Azure` that link:https://learn.microsoft.com/en-us/azure/active-directory/develop/v2-oauth2-on-behalf-of-flow#example[require using] link:https://www.rfc-editor.org/rfc/rfc7523#section-2.1[JWT bearer token grant] to exchange the current token, you can configure `AccessTokenRequestFilter` to exchange the token like this:
ja_jp: `Azure` のように、現在のトークンを交換するために link:https://www.rfc-editor.org/rfc/rfc7523#section-2.1[JWT ベアラートークングラント] の link:https://learn.microsoft.com/en-us/azure/active-directory/develop/v2-oauth2-on-behalf-of-flow#example[使用を要求する] プロバイダーを使用する場合、次のように `AccessTokenRequestFilter` を構成してトークンを交換できます。

source: If you work with providers such as `Azure` that link:https://learn.microsoft.com/en-us/azure/active-directory/develop/v2-oauth2-on-behalf-of-flow#example[require using] link:https://www.rfc-editor.org/rfc/rfc7523#section-2.1[JWT bearer token grant] to exhange the current token then you can configure `AccessTokenRequestFilter` to exchange the token like this:
ja_jp: `Azure` のように、 link:https://www.rfc-editor.org/rfc/rfc7523#section-2.1[JWTベアラートークングラント] を使用して現在のトークンを交換する link:https://learn.microsoft.com/en-us/azure/active-directory/develop/v2-oauth2-on-behalf-of-flow#example[必要がある] プロバイダを使用する場合、 `AccessTokenRequestFilter` のようにトークンを交換するように設定することができます：

source: If you work with providers such as `Azure` that link:https://learn.microsoft.com/en-us/azure/active-directory/develop/v2-oauth2-on-behalf-of-flow#example[require using] link:https://www.rfc-editor.org/rfc/rfc7523#section-2.1[JWT bearer token grant] to exhange the current token then you can configure `AccessTokenRequestReactiveFilter` to exchange the token like this:
ja_jp: `Azure` のように、 link:https://www.rfc-editor.org/rfc/rfc7523#section-2.1[JWTベアラートークングラント] を使用して現在のトークンを交換する link:https://learn.microsoft.com/en-us/azure/active-directory/develop/v2-oauth2-on-behalf-of-flow#example[必要がある] プロバイダを使用する場合、 `AccessTokenRequestReactiveFilter` をトークンを交換するように設定することができます：

source: If you work with the opaque tokens then you can test them as follows:
ja_jp: 不透明なトークンを使用する場合は、次のようにテストできます。

source: If you work work with the OIDC client filters then you must register a custom filter which will provide this assertion.
ja_jp: OIDC クライアントフィルターを使用する場合は、このアサーションを提供するカスタムフィルターを登録する必要があります。

source: If you would like to develop test cases running top of the kubernetes cluster (launched as test container by the Dev Service), then add the following dependencies to your pom file
ja_jp: kubernetesクラスタ上でテストケースを開発したい場合（Dev Serviceによってテストコンテナとして起動）、以下の依存関係をpomファイルに追加します。

source: If you would like to enforce CSRF prevention in a Cross-origin environment, please avoid supporting all Origins.
ja_jp: クロスオリジン環境でCSRF防止を実施したい場合は、すべてのオリジンをサポートするのは避けてください。

source: If you would like to have Quarkus OIDC extension enabled at runtime then set `quarkus.oidc.tenant-enabled=false` at build time and re-enable it at runtime using a system property. See also xref:security-openid-connect-multitenancy.adoc#disable-tenant[Disabling Tenant Configurations] for more information about managing the individual tenant configurations in the multi-tenant OIDC deployments.
ja_jp: 実行時に Quarkus OIDC エクステンションを有効にしたい場合は、ビルド時に `quarkus.oidc.tenant-enabled=false` を設定し、システムプロパティーを使用して実行時に再度有効にします。マルチテナント OIDC デプロイメントでの個々のテナント設定の管理の詳細については、xref:security-openid-connect-multitenancy.adoc#disable-tenant[Disabling Tenant Configurations] も参照してください。

source: If you would like to initialize the DB when you start the Quarkus app in your production environment, add `quarkus.hibernate-orm.database.generation=drop-and-create` to the Quarkus startup options in addition to `import.sql`.
ja_jp: 本番環境でQuarkusアプリを起動したときにDBを初期化したい場合は、 `import.sql` に加えて、Quarkusの起動オプションに `quarkus.hibernate-orm.database.generation=drop-and-create` を追加します。

source: If you would like to initialize the DB when you start the Quarkus app in your production environment, add `quarkus.hibernate-orm.schema-management.strategy=drop-and-create` to the Quarkus startup options in addition to `import.sql`.
ja_jp: 本番環境で Quarkus アプリケーションを起動する際に DB を初期化したい場合は、 `import.sql` に加えて、Quarkus の起動オプションに `quarkus.hibernate-orm.schema-management.strategy=drop-and-create` を追加します。

source: If you would like to learn how to migrate Vert.x OIDC to Quarkus OIDC, please follow to the next <<vertx-oidc-to-quarkus-oidc>> section.
ja_jp: Vert.x OIDC から Quarkus OIDC への移行方法を学びたい場合は、次の <<vertx-oidc-to-quarkus-oidc>> セクションに進んでください。

source: If you would like to support authenticating users with more than one provider then a provider-specific tenant configuration resolution must be supported.
ja_jp: 複数のプロバイダーによるユーザー認証をサポートする場合は、プロバイダー固有のテナント設定解決をサポートする必要があります。

source: If you would like to treat a `scope` claim as a source of roles, then each space separated value in the `scope` claim is a role name. But string claims containing multiple role values can also be separated by the comma `,` or other characters. Use `quarkus.oidc.roles.role-claim-separator=,`, etc, in such cases.
ja_jp: `scope` クレームをロールのソースとして扱いたい場合、`scope` クレーム内のスペースで区切られた各値がロール名となります。しかし、複数のロール値を含む文字列クレームは、カンマ `,` やその他の文字で区切られている場合もあります。そのような場合には `quarkus.oidc.roles.role-claim-separator=,` などを使用してください。

source: If you would like to use RSA or EC public keys to encrypt the token then it is recommended to sign the token first if the signing key is available, see the next <<innersign-encrypt-claims, Sign the claims and encrypt the nested JWT token>> section.
ja_jp: RSA または EC 公開鍵を使用してトークンを暗号化する場合、署名鍵が使用可能であれば最初にトークンに署名することをお勧めします。詳細については、次の<<innersign-encrypt-claims, クレームへの署名とネストされた JWT トークンの暗号化>> セクションを参照してください。

source: If you would like to use RSA or EC public keys to encrypt the token then it is recommended to sign the token first if the signing key is available, see the next xref:innersign-encrypt-claims[Sign the claims and encrypt the nested JWT token] section.
ja_jp: RSAやECの公開鍵を使用してトークンを暗号化したい場合は、署名鍵が利用可能であれば、まずトークンに署名することをお勧めします。次の xref:innersign-encrypt-claims[クレームへの署名とネストされたJWTトークンの暗号化] セクションを参照してください。

source: If you would like, you can disable it with `quarkus.oidc.follow-redirects=false`.
ja_jp: これは、必要に応じて `quarkus.oidc.follow-redirects=false` で無効にできます。

source: If you write reactive/async code, you have to cut your work into a pipeline of code blocks that get executed "later", and in practice after the method you defined them in has returned. As such, `try/finally` blocks as well as `ThreadLocal` variables stop working, because your reactive code gets executed in another thread, after the caller ran its `finally` block.
ja_jp: リアクティブ/非同期コードを書く場合、「後で」実行されるコードブロックのパイプラインに作業を切り込まなければならず、実際には、定義したメソッドがreturnされた後に実行されます。そのため、 `try/finally` ブロックや `ThreadLocal` 変数は動作しなくなります。なぜならば、呼び出し元が `finally` ブロックを実行した後に、リアクティブコードは別のスレッドで実行されるからです。

source: If you write reactive/async code, you have to cut your work into a pipeline of code blocks that get executed "later", and in practice after the method you defined them in have returned. As such, `try/finally` blocks as well as `ThreadLocal` variables stop working, because your reactive code gets executed in another thread, after the caller ran its `finally` block.
ja_jp: リアクティブ/非同期コードを書く場合、「後で」実行されるコードブロックのパイプラインに作業を切り 込まなければならず、実際には、定義したメソッドがreturnされた後に実行されます。そのため、 `try/finally` ブロックや `ThreadLocal` 変数は動作しなくなります。なぜならば、呼び出し元が `finally` ブロックを実行した後に、 リアクティブコードは別のスレッドで実行されるからです。

source: If you'd like to access a public resource without `quarkus-keycloak-authorization` trying to apply its policies to it then you need to create a `permit` HTTP Policy configuration in `application.properties` as documented in the xref:security-authorization.adoc[Security Authorization] guide.
ja_jp: `quarkus-keycloak-authorization` のポリシーを適用せずにパブリックリソースにアクセスしたい場合は、 link:security-authorization.html[Security Authorization] ガイドで説明されているように、 `application.properties` で `permit` HTTP Policy の設定を作成する必要があります。

source: If you'd like to access a public resource without `quarkus-keycloak-authorization` trying to apply its policies to it then you need to create a `permit` HTTP Policy configuration in `application.properties` as documented in the xref:security-authorize-web-endpoints-reference.adoc[Security Authorization] guide.
ja_jp: `quarkus-keycloak-authorization` のポリシーを適用せずにパブリックリソースにアクセスしたい場合は、 link:security-authorization.html[Security 認可] ガイドで説明されているように、 `application.properties` で `permit` HTTP Policy の設定を作成する必要があります。

source: If you'd like to block access to the public resource to anonymous users then you can create an enforcing Keycloak Authorization Policy:
ja_jp: 匿名ユーザのパブリックリソースへのアクセスをブロックしたい場合は、強制力のあるKeycloak Authorization Policyを作成します。

source: If you'd like to block an access to the public resource to anonymous users then you can create an enforcing Keycloak Authorization Policy:
ja_jp: 匿名ユーザーによる公開リソースへのアクセスをブロックしたい場合は、強制的なKeycloak認可ポリシーを作成することができます:
